#!/bin/bash

get_cpu_cores() {
  core_1=$(cat /proc/cpuinfo | grep "cpu cores" | awk -F":" '{printf $2}'|awk '{print $1}')
  core_2=$(cat /proc/cpuinfo | grep "cpu cores" | awk -F":" '{printf $2}'|awk '{print $2}')
  echo "============================================================================="
  echo "                         Информация о ядрах"
  echo "============================================================================="
  echo -e "\tКоличество ядер на процессор:\t"$core_1
  echo -e "\t                  Всего ядер:\t"$((($core_1 + $core_2)))
}
get_mem_info() {
  a=$(head -n2 /proc/meminfo | awk '{print $2}')
  echo "============================================================================="
  echo "                         Информация об оперативной памяти"
  echo "============================================================================="
  total_ram=$(echo $a | awk '{print $1}')
  free_ram=$(echo $a | awk '{print $2}')
  echo -e "\t   Всего оперативной памяти:\t$total_ram Кб"
  echo -e "\tСвободно оперативной памяти:\t$free_ram Кб"
  echo -e "\t               Используется:\t$(($total_ram - $free_ram)) Кб"
}
get_disk_info(){
  disk_name=$(df -h | egrep -e "/dev/(vd|sd|hd)" | awk '{print $1}')
  disk_size=$(df -h | egrep -e "/dev/(vd|sd|hd)" |awk '{print $2}')
  disk_avail=$(df -h | egrep -e "/dev/(vd|sd|hd)" |awk '{print $4}')
  echo "============================================================================="
  echo "                         Информация о дисках"
  echo "============================================================================="
  echo -e "\t                      Диск:\t""$disk_name"
  echo -e "\t        Общий размер диска:\t""$disk_size"
  echo -e "\t        Доступно на дисвке:\t""$disk_avail"
}
get_load_avg_data() {
  declare -a VAR=($(cat /proc/loadavg))
  # cat /proc/loadavg
  echo "============================================================================="
  echo "                         Текущая загрузка системы"
  echo "============================================================================="
  echo -e "\t                  1 минута:\t${VAR[0]}"
  echo -e "\t                   5 минут:\t${VAR[1]}"
  echo -e "\t                  15 минут:\t${VAR[2]}"
}
get_time_uptime() {
  echo "============================================================================="
  echo "                         Текущее время и uptime системы"
  echo "============================================================================="
  curr_time_on_host=$(uptime | awk '{print $1}')
  system_uptime_host=$(uptime | awk '{print $3}')
  echo -e "\tВремя на виртуальной машине:\t$curr_time_on_host"
  echo -e "\t  Uptime системы составляет:\t${system_uptime_host//,/}"
}
net_info() {
  echo "============================================================================="
  echo "                         Информация о сетевых адаптерах"
  echo "============================================================================="

  for i in $(tail -n4 /proc/net/dev | awk '{print $1 $2}')
  do
    echo "............................................................................."
    echo "$i" | awk -F":" '{print "Сетевой адаптер "$1 " -> Передано байт " $2". Подробнее:"}'
    echo "............................................................................."
    net_adapter=$(echo "$i" | awk -F":" '{print $1}')
    ifconfig "$net_adapter"
  done
}
get_listen_ports(){
  echo "============================================================================="
  echo "                         Список прослушиваемых портов"
  echo "============================================================================="
  sudo lsof -i -P | grep LISTEN
}
users_info(){
  echo "============================================================================="
  echo "                         Информация о сетевых адаптерах"
  echo "============================================================================="
  echo "............................................................................."
  echo "Список всех пользователей:"
  sed 's/:.*//' /etc/passwd | xargs
  echo "............................................................................."
  echo "Список root-пользователей:"
  sudo getent group root |awk -F":" '{print $4}'
  echo "............................................................................."
  echo "Список пользователей с правами sudo:"
  getent group sudo |awk -F":" '{print $4}'
  echo "............................................................................."
  echo "Пользователи, вошедшие в систему:"
  users
}

case "$1" in
  -h|--help)
  echo "============================================================================="
  echo "                         Справка"
  echo "============================================================================="
  echo -e "\tАргументы скрипта:"
  echo -e "\t --help  - выводит справку по скрипту"
  echo -e "\t --user  - выводит информацию о пользователях, такую, как список пользователей в системе, список root пользователей, список залогиненых пользователей"
  echo -e "\t --host  - выводит информацию о хосте, такую как количество ядер, информацию о диске, текущее время, uptime системы и многое другое."
  ;;
  --user)
        users_info
  ;;
  --host)
        get_cpu_cores
        get_mem_info
        get_disk_info
        get_load_avg_data
        get_time_uptime
        net_info
        get_listen_ports
  ;;
  '') echo "Вы не указали никаких аргументов. Для получения информации об аргументах, используемых в скрипте, обратитесь к справке, указав в качестве аргумента --help!"
  ;;
  *) echo "$1 - такой аргумент отсутствует. Для получения информации об аргументах, используемых в скрипте, обратитесь к справке, указав в качестве аргумента --help!"
  ;;
esac
